

{
  "Movies":
  [ 

{"movieName":"The Shawshank Redemption (1994)","movieDesc":"Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.","movieLen":"2h 22 mins","movieRating":"9.3/10","movieImage":"shawshank.jpg","trailer":"https://www.youtube.com/watch?v=NmzuHjWmXOc"},
{"movieName":"The Godfather (1972)","movieDesc":"The aging patriarch of an organized crime dynasty in postwar New York City transfers control of his clandestine empire to his reluctant youngest son.","movieLen":"2h 55 mins","movieRating":"9.2/10","movieImage":"godfather.jpg","trailer":"https://www.youtube.com/watch?v=UaVTIH8mujA"},       
{"movieName":"Hellraiser (1987)","movieDesc":"Sexual deviant Frank (Sean Chapman) inadvertently opens a portal to hell when he tinkers with a box he bought while abroad. The act unleashes gruesome beings called Cenobites, who tear Frank's body apart. When Frank's brother (Andrew Robinson) and his wife, Julia (Clare Higgins), move into Frank's old house, they accidentally bring what is left of Frank back to life. Frank then convinces Julia, his one-time lover, to lure men back to the house so he can use their blood to reconstruct himself.","movieLen":"1h 34 mins","movieRating":"6.9/10","movieImage":"hellraiser.jpeg","trailer":"https://www.youtube.com/watch?v=OpEQNEHKdXg"},
{"movieName":"Forrest Gump (1994)","movieDesc":"The presidencies of Kennedy and Johnson, the Vietnam War, the Watergate scandal and other historical events unfold from the perspective of an Alabama man with an IQ of 75, whose only desire is to be reunited with his childhood sweetheart.","movieLen":"2h 22 mins","movieRating":"8.8/10","movieImage":"gump.jpg","trailer","https://www.youtube.com/watch?v=bLvqoHBptjg"},
{"movieName":"Star Wars Episode IV - A New Hope (1977)","movieDesc":"Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a Wookiee and two droids to save the galaxy from the Empire's world-destroying battle station, while also attempting to rescue Princess Leia from the mysterious Darth Vader.","movieLen":"2h 1 mins","movieRating":"8.6/10","movieImage":"starwars.jpg","trailer":"https://www.youtube.com/watch?v=vZ734NWnAHA"},
{"movieName":"Interstellar (2014)","movieDesc":"In Earth's future, a global crop blight and second Dust Bowl are slowly rendering the planet uninhabitable. Professor Brand (Michael Caine), a brilliant NASA physicist, is working on plans to save mankind by transporting Earth's population to a new home via a wormhole. But first, Brand must send former NASA pilot Cooper (Matthew McConaughey) and a team of researchers through the wormhole and across the galaxy to find out which of three planets could be mankind's new home.","movieLen":"2h 49 mins","movieRating":"8.6/10","movieImage":"interstellar.jpeg","trailer":"https://www.youtube.com/watch?v=zSWdZVtXT7E"},
{"movieName":"The Fast and the Furious (2001)","movieDesc":"Dominic Toretto (Vin Diesel) enjoys the adrenaline of street car racing and his fans treat him like a rock star. After a blazing encounter with the ruthless Johnny Tran, Dom decides to take Brian (Paul Walker), a newcomer to street racing, under his wing. Dom's sister Mia sees something she likes in Brian, too. Trouble is, neither of them realize he's an undercover cop, and Dominic and his rival Johnny Tran are both the prime suspects in a case involving dirty money and big-rig hijacking.","movieLen":"1h 46 mins","movieRating":"6.8/10","movieImage":"fast.jpeg","trailer":"https://www.youtube.com/watch?v=2TAOizOnNPo"},
{"movieName":"The Fast and the Furious: Tokyo Drift (2006)","movieDesc":"Sean Boswell (Lucas Black) always feels like an outsider, but he defines himself through his victories as a street racer. His hobby makes him unpopular with the authorities, so he goes to live with his father in Japan. Once there and even more alienated, he learns about an exciting, but dangerous, new style of the sport. The stakes are high when Sean takes on the local champion and falls for the man's girlfriend.","movieLen":"1h 44 mins","movieRating":"6/10","movieImage":"tokyo.jpeg","trailer":"https://www.youtube.com/watch?v=p8HQ2JLlc4E"},
{"movieName":"The Dark Knight (2008)","movieDesc":"With the help of allies Lt. Jim Gordon (Gary Oldman) and DA Harvey Dent (Aaron Eckhart), Batman (Christian Bale) has been able to keep a tight lid on crime in Gotham City. But when a vile young criminal calling himself the Joker (Heath Ledger) suddenly throws the town into chaos, the caped Crusader begins to tread a fine line between heroism and vigilantism.","movieLen":"2h 32 mins","movieRating":"9/10","movieImage":"darkknight.jpeg","trailer":"https://www.youtube.com/watch?v=EXeTwQWrcwY"},       
{"movieName":"The Lord of the Ring: The Return of the King (2003)","movieDesc":"The culmination of nearly 10 years' work and conclusion to Peter Jackson's epic trilogy based on the timeless J.R.R. Tolkien classic, 'The Lord of the Rings: The Return of the King' presents the final confrontation between the forces of good and evil fighting for control of the future of Middle-earth. Hobbits Frodo and Sam reach Mordor in their quest to destroy the `one ring', while Aragorn leads the forces of good against Sauron's evil army at the stone city of Minas Tirith.","movieLen":"3h 30 mins","movieRating":"9/10","movieImage":"rings.jpeg","trailer":"https://www.youtube.com/watch?v=r5X-hFf6Bwo"},       
{"movieName":"The Matrix (1999)","movieDesc":"Neo (Keanu Reeves) believes that Morpheus (Laurence Fishburne), an elusive figure considered to be the most dangerous man alive, can answer his question -- What is the Matrix? Neo is contacted by Trinity (Carrie-Anne Moss), a beautiful stranger who leads him into an underworld where he meets Morpheus. They fight a brutal battle for their lives against a cadre of viciously intelligent secret agents. It is a truth that could cost Neo something more precious than his life.","movieLen":"2h 16 mins","movieRating":"8.7/10","movieImage":"matrix.jpeg","trailer":"https://www.youtube.com/watch?v=9ix7TUGVYIo"},
{"movieName":"Goodfellas (1990)","movieDesc":"A young man grows up in the mob and works very hard to advance himself through the ranks. He enjoys his life of money and luxury, but is oblivious to the horror that he causes. A drug addiction and a few mistakes ultimately unravel his climb to the top. Based on the book 'Wiseguy' by Nicholas Pileggi.",
"movieLen":"2h 26 mins","movieRating":"8.7/10","movieImage":"goodfellas.jpeg","trailer":"https://www.youtube.com/watch?v=qo5jJpHtI1Y"},
{"movieName":"Pulp Fiction (1994)","movieDesc":"Vincent Vega (John Travolta) and Jules Winnfield (Samuel L. Jackson) are hitmen with a penchant for philosophical discussions. In this ultra-hip, multi-strand crime movie, their storyline is interwoven with those of their boss, gangster Marsellus Wallace (Ving Rhames) ; his actress wife, Mia (Uma Thurman) ; struggling boxer Butch Coolidge (Bruce Willis) ; master fixer Winston Wolfe (Harvey Keitel) and a nervous pair of armed robbers, 'Pumpkin' (Tim Roth) and 'Honey Bunny' (Amanda Plummer).","movieLen":"2h 34 mins","movieRating":"8.9/10","movieImage":"pulp.jpeg","trailer":"https://www.youtube.com/watch?v=s7EdQ4FqbhY"},
{"movieName":"Parasite (2019)","movieDesc":"Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan.","movieLen":"2h 12 mins","movieRating":"8.5/10","movieImage":"parasite.jpeg","trailer":"https://www.youtube.com/watch?v=isOGD_7hNIY"},
{"movieName":"Up (2009)","movieDesc","Carl Fredricksen, a 78-year-old balloon salesman, is about to fulfill a lifelong dream. Tying thousands of balloons to his house, he flies away to the South American wilderness. But curmudgeonly Carl's worst nightmare comes true when he discovers a little boy named Russell is a stowaway aboard the balloon-powered house. A Pixar animation.","movieLen","1h 36 mins","movieRating","8.3/10","movieImage","up.jpeg","trailer","https://www.youtube.com/watch?v=HWEW_qTLSEE"}
],
"Status":"OK"
}
